lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/* SPDX-License-Identifier: Apache-2.0 */
/*
 * main.c - RV32 emulator firmware for the Nucleo-F746ZG.
 *
 * Bring-up is done entirely with ST's own driver pack: the CMSIS device
 * headers for register definitions, ST's startup file and
 * system_stm32f7xx.c, and the STM32Cube HAL for the clock tree, GPIO and
 * USART. Nothing here reimplements a peripheral the vendor already
 * supports.
 *
 * What this file adds is the glue: a guest address space built out of ARM
 * memory and ARM peripherals, and a run loop that hands control back often
 * enough for the ARM side to keep servicing its own interrupts.
 */

#include "stm32f7xx_hal.h"
#include "board.h"

#include "emu/emu_cpu.h"
#include "emu/emu_dev.h"
#include "emu/emu_memmap.h"

#if EMU_FRONTEND_RV32
#  include "rv32/rv_backend.h"  /* which backend came up */
#  include "rv32/rv_jit.h"      /* JIT statistics, reported below */
#endif

#if EMU_NET
#  include "emu_net.h"
#endif

#include <string.h>

/* The guest binary, embedded by guest_image.S. */
extern const uint8_t rv_guest_image[];
extern const uint32_t rv_guest_image_size;
extern const uint32_t rv_guest_ro_size;

/* ------------------------------------------------------------------ */
/* Configuration                                                       */
/* ------------------------------------------------------------------ */

/*
 * Guest RAM is not a fixed-size array: the link script places it between
 * the firmware's .bss and the stack and gives it everything in between, so
 * the guest automatically receives all the SRAM the ARM side is not using
 * (see .guest_ram in stm32f746retx.ld).
 */
extern uint8_t __guest_ram_start[];
extern uint8_t __guest_ram_end[];

#define GUEST_RAM_BASE_PTR  (__guest_ram_start)
#define GUEST_RAM_SIZE      ((uint32_t)(__guest_ram_end - __guest_ram_start))

/* Guest time runs at 1 MHz, derived from the DWT cycle counter. */
#define EMU_TIMER_HZ        1000000u

/* Instructions executed between returns to the ARM side. */
/*
 * A cap on how long a guest may run before the firmware gives up.
 *
 * The host runner has --max-insn and two of the Berkeley tests depend on
 * it to terminate at all -- they are *meant* to run away, and the cap is
 * what turns that into a reported failure. The board had no equivalent,
 * so the same guest hangs it: no output, no prompt, and the only way out
 * is a reset, which is indistinguishable from a firmware crash. That is
 * the difference between a suite that reports 273 passed and 1 failed
 * and one that stops after test 47 and needs a human.
 *
 * Zero disables it, which is what an interactive session or a benchmark
 * wants. The default is generous: CoreMark retires about 1.3 million
 * instructions a run and the architecture tests far fewer, so anything
 * reaching this is not making progress.
 */
#ifndef EMU_MAX_INSN
#define EMU_MAX_INSN         100000000u
#endif

#ifndef EMU_RUN_SLICE
#define EMU_RUN_SLICE        4096u
#endif

/* ------------------------------------------------------------------ */
/* State                                                               */
/* ------------------------------------------------------------------ */

#if RV_ENABLE_JIT
/*
 * Code cache for translated blocks. Ordinary .bss: the ARMv7-M default
 * memory map makes SRAM executable, so no MPU work is needed. This comes
 * out of what the guest would otherwise get, which is the trade the JIT
 * asks for.
 */
#endif

static emu_bus_t  g_bus;
static emu_core_t g_core;
static emu_uart_t g_uart;

/* ------------------------------------------------------------------ */
/* Console                                                             */
/* ------------------------------------------------------------------ */

/*
 * Stop, having said why.
 *
 * The obvious implementation -- mask interrupts and spin -- is right up
 * until emu_net_init() succeeds, and after it is the worst thing this
 * file can do. By then the console is a ring buffer drained by telnet,
 * so masking interrupts means the message explaining the failure is
 * written to memory nobody will ever read: the board answers no ping, no
 * telnet and no TFTP, and presents as a dead link rather than as a
 * firmware that knows exactly what went wrong and cannot say so.
 *
 * That is not hypothetical. A startup ordering bug two functions below
 * halted here with "could not build the guest address space" sitting in
 * the ring, and the symptom was a silent SLIP link -- an hour spent on
 * the network for a fault that had already diagnosed itself.
 *
 * So with the stack up, keep servicing it forever instead. Nothing else
 * runs, which is the point of a halt; a client can still connect and
 * collect the reason.
 */
static void fatal_halt(void)
{
#if EMU_NET
    if (emu_net_active()) {
        for (;;) {
            emu_net_poll();
        }
    }
#endif
    __disable_irq();
    for (;;) {
        /* No console to report on: halt so a debugger sees where. */
    }
}

/*
 * One console, two possible sinks. Before emu_net_init() succeeds it is
 * the UART; after, the UART carries SLIP and cannot carry text as well,
 * so everything goes to the telnet buffer instead.
 *
 * The branch is a load and a test per character, which is nothing: the
 * console is written by human-readable output and by the guest's virtual
 * UART, neither of which is on any measured hot path. The same is not
 * true of the run loop, which is why emu_net_poll() below is the thing
 * that had to be thought about.
 */
void rv_console_putc(uint8_t c)
{
#if EMU_NET
    if (emu_net_active()) {
        emu_net_console_putc(c);
        return;
    }
#endif
    board_console_putc(c);
}

static int console_getc(void)
{
#if EMU_NET
    if (emu_net_active()) {
        return emu_net_console_getc();
    }
#endif
    return board_console_getc();
}

#define console_putc rv_console_putc

static void console_puts(const char *s)
{
    while (*s != '\0') {
        if (*s == '\n') {
            console_putc('\r');   /* terminals expect CRLF */
        }
        console_putc((uint8_t)*s++);
    }
}

static void console_puthex(uint32_t v)
{
    static const char hex[] = "0123456789abcdef";
    console_puts("0x");
    for (int i = 28; i >= 0; i -= 4) {
        console_putc((uint8_t)hex[(v >> i) & 0xFu]);
    }
}

static void console_putu(uint32_t v)
{
    char tmp[10];
    unsigned n = 0;
    do {
        tmp[n++] = (char)('0' + (v % 10u));
        v /= 10u;
    } while (v != 0u);
    while (n != 0u) {
        console_putc((uint8_t)tmp[--n]);
    }
}

#ifdef EMU_JIT_DIFF
/*
 * A block whose compiled code disagreed with the IR interpreter.
 *
 * `off` is a byte offset into the guest state, so the register file
 * starts at zero and the number is the register times four. Only the
 * first few are printed: everything after the first divergence is
 * downstream of the same bug, and a UART at 921600 is not a debugger.
 */
void emu_jit_diff_report(uint32_t pc, uint32_t off, uint32_t want,
                         uint32_t got);
void emu_jit_diff_report(uint32_t pc, uint32_t off, uint32_t want,
                         uint32_t got)
{
    static unsigned reported;

    if (reported++ >= 12u) {
        return;
    }
    console_puts("jit-diff pc ");
    console_puthex(pc);
    console_puts(" +");
    console_putu(off);
    console_puts(" want ");
    console_puthex(want);
    console_puts(" got ");
    console_puthex(got);
    console_puts("\n");
}
#endif


/* Transport hooks for the guest's virtual UART. */
static void guest_uart_tx(void *ctx, uint8_t c)
{
    (void)ctx;
    if (c == '\n') {
        console_putc('\r');
    }
    console_putc(c);
}

static int guest_uart_rx(void *ctx)
{
    (void)ctx;
    return console_getc();
}

