lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * Only the writable tail. The read-only half is already reachable as
     * a bus region pointing into flash, and copying it would put it in
     * RAM twice -- which is the whole cost the split removes.
     *
     * The rest of guest RAM is cleared. Left alone it would still hold
     * the previous guest's .bss and stack, which is how one architecture
     * test comes to pass on state another test wrote -- the failure mode
     * that makes a suite's results depend on the order it ran in.
     */
    memcpy(GUEST_RAM_BASE_PTR, g_img + g_img_ro, rw);
    memset(GUEST_RAM_BASE_PTR + rw, 0, GUEST_RAM_SIZE - rw);

    emu_core_reset(&g_core, EMU_GUEST_RESET_PC);
    emu_core_boot(&g_core, EMU_GUEST_RAM_BASE, GUEST_RAM_SIZE);
    return true;
}

#if EMU_NET
/* ------------------------------------------------------------------ */
/* Images arriving over TFTP                                           */
/* ------------------------------------------------------------------ */

/*
 * The emulator is already suspended whenever these run: they are reached
 * from emu_net_poll(), which the run loop calls between guest slices, so
 * no guest instruction is in flight. Nothing has to be stopped -- but
 * the restart does have to be explicit, because the bus regions and the
 * reset vector were built from the old image.
 */
static uint32_t g_up_addr;      /* where the rom half is being written  */
static uint32_t g_up_rw;        /* bytes of the ram half received       */
static bool     g_reload;

bool emu_net_image_begin(emu_net_image_t which)
{
    if (which == EMU_NET_IMAGE_ROM) {
        g_up_addr = board_flash_arena_begin();
        return g_up_addr != 0u;
    }
    g_up_rw = 0u;
    return true;
}

bool emu_net_image_data(emu_net_image_t which, const void *data,
                        uint32_t len, uint32_t off)
{
    if (which == EMU_NET_IMAGE_ROM) {
        return board_flash_write(g_up_addr + off, data, len);
    }

    /*
     * The writable half goes straight into guest RAM. Bounds-checked
     * rather than trusted: a TFTP client is the other end of a wire and
     * an oversized image would otherwise walk off the end of the buffer
     * into the stack.
     */
    if ((off + len) > GUEST_RAM_SIZE) {
        return false;
    }
    memcpy(GUEST_RAM_BASE_PTR + off, data, len);
    return true;
}

void emu_net_image_end(emu_net_image_t which, uint32_t len, bool ok)
{
    if (!ok) {
        /*
         * Nothing is committed, so a failed upload leaves the board
         * exactly as it was and the previous guest is still the one
         * that would run. The flash written so far is simply not
         * claimed; the next begin() hands out the same address again.
         *
         * The arena filling up is the expected failure, not an
         * exceptional one -- there is no length in a TFTP request, so
         * running out is how the end is discovered. Erasing here means
         * the client's retry succeeds rather than failing identically.
         */
        if (which == EMU_NET_IMAGE_ROM) {
            (void)board_flash_arena_reset();
        }
        console_puts("\nemu: upload failed\n");
        return;
    }

    if (which == EMU_NET_IMAGE_ROM) {
        board_flash_arena_commit(len);
        g_img = (const uint8_t *)g_up_addr;
        g_img_ro = len;
    } else {
        g_up_rw = len;
    }

    /*
     * g_img_size spans only what is contiguous with g_img. For the
     * baked-in image that is both halves; for an uploaded one the
     * writable half is in RAM and the read-only half in flash, so it is
     * the read-only half alone. Getting this wrong publishes a ROM
     * window over whatever flash follows the image.
     */
    g_img_size = g_img_ro + ((g_img == rv_guest_image) ? g_up_rw : 0u);

    g_reload = true;
}
#endif

/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */

/* emu_print_fn onto the console, for the frontend's own state dump. */
static void console_out(void *ctx, const char *s)
{
    (void)ctx;
    console_puts(s);
}

/*
 * Decoding the trap cause and naming the registers is the frontend's job:
 * only it knows what its status registers are and which of them matter
 * after a fault. This used to be a copy of that knowledge here, kept in
 * step with the core's by hand and with the other platform's by hand again.
 */
static void report_state(void)
{
    console_puts("\n-- guest state --");
    g_core.ops->dump(g_core.cpu, console_out, NULL);
}

/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M7
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_puts("\n\nrv32cortex-m: NATIVE CoreMark on Cortex-M7 @ ");
        console_putu(SystemCoreClock / 1000000u);
        console_puts(" MHz\n\n");
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_puts("\n-- native --\n  host     ");
        console_putu(board_cycles() - c0);
        console_puts(" cycles\n");
        for (;;) { __WFI(); }
    }
#endif
    /*
     * The frontend names itself, and builds its ISA string from the
     * extensions actually compiled in, so the banner cannot drift from what
     * the core implements -- which it could when this file spelled the
     * string out itself.
     */
    const emu_cpu_ops_t *const ops = emu_frontend_default();

    console_puts("\n\nrv32cortex-m: ");
    console_puts(ops->desc);
    console_puts(" on Cortex-M7 @ ");
    console_putu(SystemCoreClock / 1000000u);
    console_puts(" MHz\n");

