lfazio/rv32cortex-m/src/platform/stm32f746/main.c
#if EMU_NET
    /*
     * The handover happens here, before the rest of the banner, so that
     * everything describing what is about to run -- guest size, guest
     * RAM, which backend came up -- reaches a telnet client rather than
     * a serial port nobody is watching. It is buffered until one
     * connects, which is what net_telnet.c's output ring is for.
     *
     * The two lines below are the last thing the UART ever carries as
     * text, and they are deliberately the two that matter when nothing
     * works: whether the stack started at all, and what address to
     * connect to. After this, silence on the serial port is expected and
     * silence on the network is the fault.
     */
    console_puts("net    SLIP on this port; telnet ");
    console_puts(emu_net_addr_str());
    console_puts(" 23\n");
    if (!emu_net_init()) {
        console_puts("net    failed to start; staying on the serial console\n");
    }
#endif

    /*
     * Which image is running, before anything asks. build_address_space()
     * reads these rather than the .incbin symbols -- that is what lets an
     * upload replace the image at run time -- so leaving them until after
     * the bus is built publishes a zero-length ROM region, which the bus
     * rejects, and the firmware halts before it has run an instruction.
     */
    g_img_size = rv_guest_image_size;
    g_img_ro   = rv_guest_ro_size;

    if (!build_address_space()) {
        console_puts("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    if (!emu_core_open(&g_core, ops, &g_bus, 0u)) {
        console_puts("fatal: frontend has no core 0\n");
        fatal_halt();
    }

    ops->set_unmask_hook(g_core.cpu, irq_unmask_line, NULL);
    bridged_irqs_init();
    emu_uart_init(&g_uart, guest_uart_tx, guest_uart_rx, NULL);
    ops->set_syscall(g_core.cpu, guest_syscall, NULL);
    ops->set_cache(g_core.cpu, &g_cache_ops);

    /*
     * Now that there is a core to hang them off, put the frontend's own
     * devices on the bus and start. start_guest() does both, because a
     * reload has to do both -- see the note on it.
     */
    if (!start_guest()) {
        console_puts("fatal: could not start the guest\n");
        fatal_halt();
    }

    console_puts("guest  ");
    console_putu(g_img_size);
    console_puts(" bytes at ");
    console_puthex(EMU_GUEST_RESET_PC);
    console_puts("\nram    ");
    console_putu(GUEST_RAM_SIZE / 1024u);
    console_puts(" KiB (");
    console_putu(GUEST_RAM_SIZE);
    console_puts(" bytes)\nbackend ");

    emu_cpu_status_t st;
    emu_core_status(&g_core, &st);
    console_puts(st.backend);
    console_puts("\n\n");

    const uint32_t cycles_per_tick = SystemCoreClock / EMU_TIMER_HZ;
    const uint32_t start_cycles = board_cycles();
    uint64_t retired_total = 0;

    bool capped = false;

    for (;;) {
        uint32_t retired = 0;
        const emu_run_reason_t why = emu_core_run(&g_core, EMU_RUN_SLICE,
                                                  &retired);
        retired_total += retired;

#if EMU_NET
        /*
         * The stack advances only when called, so this is its entire
         * schedule. Once per slice is 4096 guest instructions, a few
         * hundred microseconds -- finer than any timer lwIP keeps and
         * far finer than the receive ring can fill, so nothing here
         * needs its own interrupt beyond the one taking bytes off the
         * wire.
         *
         * It is also the reason this port does not want an RTOS. A
         * scheduler would preempt on its tick, which is coarser than
         * this loop already is, and would buy nothing in exchange for
         * two stacks and lwIP's threaded API.
         */
        emu_net_poll();

        /*
         * A new image landed while the guest was between slices. Restart
         * from it, and restart the accounting with it -- a run whose
         * instruction count carried over from the previous guest would
         * hit the cap early and report "did not terminate" about a guest
         * that had barely started.
         */
        if (g_reload) {
            g_reload = false;
            if (!start_guest()) {
                console_puts("emu: uploaded image does not fit guest RAM\n");
            } else {
                console_puts("\nemu: running uploaded image, ");
                console_putu(g_img_ro);
                console_puts(" ro + ");
                console_putu(g_up_rw);
                console_puts(" rw bytes\n");
            }
            retired_total = 0;
            capped = false;
            continue;
        }
#endif

        /*
         * Compared against the running total rather than a budget
         * counted down to zero. A block backend may retire more than
         * the slice it was given -- it can only stop between blocks --
         * so a remaining-budget subtraction goes below zero and wraps,
         * and the cap silently stops existing. That exact bug shipped in
         * the host runner and was invisible for the life of the project,
         * because the interpreter happens to land on the boundary
         * exactly.
         */
        if (EMU_MAX_INSN != 0u && retired_total >= (uint64_t)EMU_MAX_INSN) {
            capped = true;
            break;
        }

        /* Guest time tracks real time through the DWT cycle counter. */
        ops->set_time(g_core.cpu,
                      (uint64_t)(board_cycles() - start_cycles) / cycles_per_tick);

        if (why == EMU_RUN_HALTED) {
            break;
        }
        if (why == EMU_RUN_WFI) {
            emu_core_status(&g_core, &st);
            if (st.wakeable) {
                continue;
            }
            console_puts("\nguest parked with no interrupts enabled\n");
            break;
        }
    }

    const uint32_t elapsed = board_cycles() - start_cycles;

    if (capped) {
        /*
         * Named on its own line and before the statistics, so a harness
         * reading the console can tell "did not terminate" from "ran and
         * failed" without parsing the numbers.
         */
        console_puts("\nemu: instruction cap reached, guest did not halt\n");
    }

    console_puts("\n-- done --\n  retired  ");
    console_putu((uint32_t)retired_total);
    console_puts(" instructions\n  host     ");
    console_putu(elapsed);
    console_puts(" cycles\n  ratio    ");
    if (retired_total != 0u) {
        /* Host ARM cycles per emulated guest instruction, x100 so the
         * fractional part survives integer division. */
        const uint32_t x100 = (uint32_t)((uint64_t)elapsed * 100u / retired_total);
        console_putu(x100 / 100u);
        console_putc('.');
        console_putu((x100 % 100u) / 10u);
        console_putu(x100 % 10u);
        console_puts(" host cycles per guest instruction\n  speed    ");
        const uint32_t kips =
            (uint32_t)((uint64_t)retired_total * (SystemCoreClock / 1000u) / elapsed);
        console_putu(kips);
        console_puts(" KIPS\n");
    }

