lfazio/rv32cortex-m/src/platform/stm32f746/main.c
/*
 * JIT statistics: the one place in this file that names a frontend, and
 * unavoidably so -- the Thumb-2 JIT is the rv32 frontend's second backend.
 */
#if EMU_FRONTEND_RV32 && RV_ENABLE_JIT
    if (rv_backend == &rv_backend_jit) {
        rv_jit_stats_t js;
        rv_jit_get_stats(&js);
        console_puts("\n-- jit --\n  blocks   ");
        console_putu(js.blocks);
        console_puts("\n  code     ");
        console_putu(js.code_used);
        console_putc('/');
        console_putu(js.code_size);
        console_puts(" bytes\n  blks/xlat ");
        console_putu(js.translations);
        console_puts("\n  compact  ");
        console_putu(js.compactions);
        console_puts(" (");
        console_putu(js.evictions);
        console_puts(" evicted)\n  flushes  ");
        console_putu(js.flushes);
        /*
         * Instructions the translator declined and the interpreter ran.
         * A high share here is the first place to look when the speedup
         * is smaller than expected: it names exactly which encodings are
         * worth teaching the translator next.
         */
        console_puts("\n  interp   ");
        console_putu(js.interp_fallbacks);
        console_puts(" instructions fell back\n  helpers  muldiv ");
        console_putu(js.alu_calls_muldiv);
        console_puts("  clmul ");
        console_putu(js.alu_calls_clmul);
        console_puts("  bit ");
        console_putu(js.alu_calls_bit);
        console_puts("\n  pt hits  ");
        console_putu(js.pt_hits);
        console_puts(" armed ");
        console_putu(js.pt_armed);
        console_puts("\n  declined ");
        console_putu(js.declined);
        console_puts(" overflow ");
        console_putu(js.overflowed);
#ifdef EMU_JIT_PROFILE
        console_puts("\n  cyc xlat ");
        console_putu(js.cyc_translate);
        console_puts(" compact ");
        console_putu(js.cyc_compact);
#endif
        console_puts("\n  blk entr ");
        console_putu(js.block_entries);
        /*
         * Reads per block that uses the register, x100. Below 100 a cache
         * cannot pay: the block would spend a load to save fewer than one.
         */
        {
            static const char *const nm[4] = { "sp", "ra", "a0", "a1" };
            console_puts("\n  reads/blk");
            for (unsigned i = 0; i < 4u; i++) {
                console_putc(' ');
                console_puts(nm[i]);
                console_putc('=');
                if (js.hot_blocks[i] != 0u) {
                    const uint32_t x100 = js.hot_reads[i] * 100u / js.hot_blocks[i];
                    console_putu(x100 / 100u);
                    console_putc('.');
                    console_putu((x100 % 100u) / 10u);
                    console_putu(x100 % 10u);
                } else {
                    console_puts("-");
                }
                console_puts(" in ");
                console_putu(js.hot_blocks[i]);
            }
        }
        console_putc('\n');
    }
#endif

    report_state();

#if EMU_NET
    /*
     * Bytes the wire delivered and nothing collected. Reported next to
     * the guest's own numbers because it is the one failure that makes
     * *those* numbers untrustworthy without looking wrong: a dropped
     * byte is a dropped SLIP frame, which is a retransmission at best
     * and a truncated image at worst.
     */
    console_puts("\n-- net --\n  rx drops ");
    console_putu(board_console_rx_overruns());
    console_putc('\n');
#endif

    for (;;) {
#if EMU_NET
        /*
         * Everything above is still sitting in the output ring: the run
         * loop stopped, and with it the only thing that was delivering.
         * Parking in __WFI without draining first would lose the entire
         * report -- which is the part a harness came for.
         *
         * __WFI is still right rather than a busy loop. The UART receive
         * interrupt is what wakes it, and that fires on the first byte
         * of anything the host sends, including the ACK for what is
         * being flushed here.
         */
        emu_net_poll();
#endif
        __WFI();
    }
}
